# 数据加载、存储与文件格式

## 6.1 读写文本格式的数据

In [2]:
import pandas as pd
df = pd.read_csv('ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
#pd.read_table('examples/ex1.csv', sep=',')

In [5]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [8]:
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1', 'key2'])

In [9]:
parsed

           values1  values2
key1 key2
one  a           1        2
     b           3        4
     c           5        6
     d           7        8
two  a           9       10
     b          11       12
     c          13       14
     d          15       16

In [10]:
pd.read_csv('ex1.csv', skiprows=[0, 2, 3])

Empty DataFrame
Columns: [1, 2, 3, 4, hello]
Index: []

In [11]:
result = pd.read_csv('ex1.csv')

In [12]:
result

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.isnull(result)

       a      b      c      d  message
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False

In [14]:
result = pd.read_csv('ex1.csv', na_values=['NULL'])

In [15]:
result

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [17]:
pd.read_csv('ex1.csv', na_values=sentinels)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     NaN

## zhukuai逐块读取文本文件

In [18]:
pd.options.display.max_rows = 10

In [20]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [23]:
pd.read_csv('./ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [25]:
chunker = pd.read_csv('./ex6.csv', chunksize=1000)

In [27]:
chunker

In [29]:
chunker = pd.read_csv('./ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [31]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## 将数据写出到文本格式

In [33]:
data = pd.read_csv('./ex5.csv')

In [35]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
data.to_csv('./out.csv')#可以直接写，但系文件夹要新建

In [41]:
import sys

In [43]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [45]:
data = pd.read_csv('./out.csv')

In [47]:
data

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [49]:
data.to_csv(sys.stdout, index=False, header=False)

0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [51]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [53]:
dates = pd.date_range('1/1/2000', periods=7)

In [56]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [61]:
#ts.to_csv('./tseries.csv')

In [63]:
import csv
f = open('./ex7.csv')

In [65]:
reader = csv.reader(f)

In [68]:
for line in reader:print(line)

In [70]:
with open('./ex7.csv') as f:lines = list(csv.reader(f))

In [72]:
header, values = lines[0], lines[1:]

In [74]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [76]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [79]:
# class my_dialect(csv.Dialect):
#     lineterminator = '\n'
#     delimiter = ';'
#     quotechar = '"'
#     quoting = csv.QUOTE_MINIMAL
# reader = csv.reader(f, dialect=my_dialect)
# reader = csv.reader(f, delimiter='|')

# 6.2二进制数据格式

In [81]:
frame = pd.read_csv('./ex1.csv')

In [83]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [85]:
frame.to_pickle('./frame_pickle')

In [87]:
pd.read_pickle('./frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## hdf5格式

In [98]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [102]:
# store = pd.HDFStore('mydata.h5')

ValueError: numpy.ufunc size changed, may indicate binary incompatibility. Expected 216 from C header, got 192 from PyObject

In [97]:
import sqlite3

## 读取excel文件

In [106]:
xlsx = pd.ExcelFile('./ex1.xlsx')

In [108]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [110]:
frame = pd.read_excel('./ex1.xlsx', 'Sheet1')

In [112]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [115]:
writer = pd.ExcelWriter('./ex2.xlsx')

In [117]:
frame.to_excel(writer, 'Sheet1')

In [119]:
writer.save()

In [122]:
frame.to_excel('./ex2.xlsx')

# 6.3Web Api交互

In [124]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [126]:
resp = requests.get(url)
resp

In [128]:
data = resp.json()

In [131]:
data[1]['title']

'API: getting the "densified" values of a Categorical (preserving categories dtype) ?'

In [133]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [135]:
issues

,number,title,labels,state
0,26411,"Grouping, then resampling empty DataFrame lead...",[],open
1,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
2,26409,DEPR: deprecate get_values,[],open
3,26408,BUG: MultiIndex not dropping nan level and inv...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
4,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
...,...,...,...,...
25,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
27,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
29,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open

# 6.4数据库交互

In [137]:
query = """
   .....: CREATE TABLE test
   .....: (a VARCHAR(20), b VARCHAR(20),
   .....:  c REAL,        d INTEGER
   .....: );"""

In [139]:
con = sqlite3.connect('mydata.sqlite')

In [141]:
con.execute(query)

OperationalError: table test already exists

In [143]:
con.commit()

In [145]:
data = [('Atlanta', 'Georgia', 1.25, 6),
   .....:         ('Tallahassee', 'Florida', 2.6, 3),
   .....:         ('Sacramento', 'California', 1.7, 5)]

In [147]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [149]:
con.executemany(stmt, data)

In [151]:
cursor = con.execute('select * from test')

In [153]:
rows = cursor.fetchall()

In [155]:
rows

[]

In [157]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [159]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [161]:
import sqlalchemy as sqla

ModuleNotFoundError: No module named 'sqlalchemy'

In [ ]:
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)